constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    side
    {
        type            slip;
        inGroups        1(slip);
        nFaces          2242;
        startFace       100249;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4960;
        startFace       102491;
    }
    slip1
    {
        type            slip;
        inGroups        1(slip);
        nFaces          806;
        startFace       107451;
    }
)

// ************************************************************************* //
